#+Startup: fold
#+TITLE: Training Low Rank RNNs
#+PROPERTY: header-args:ipython :results both :exports both :async yes :session dual_flow :kernel torch :exports results :output-dir ./figures/flow :file (lc/org-babel-tangle-figure-filename)


* Imports

#+begin_src ipython
import torch
import torch.nn as nn
import torch.optim as optim
import torchmetrics
import gc
from torch.utils.data import Dataset, TensorDataset, DataLoader

REPO_ROOT = "/home/leon/models/NeuroFlame"

import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

pal = sns.color_palette("tab10")
DEVICE = 'cuda:1'
#+end_src

#+RESULTS:

#+begin_src ipython
import sys
sys.path.insert(0, '../../../')

from notebooks.setup import *

import pandas as pd
import torch.nn as nn
from time import perf_counter
from scipy.stats import circmean

from src.network import Network
from src.plot_utils import plot_con
from src.decode import decode_bump, circcvl
from src.lr_utils import masked_normalize, clamp_tensor, normalize_tensor
#+end_src

#+RESULTS:
: Python exe
: /home/leon/mambaforge/envs/torch/bin/python

#+begin_src ipython :tangle ../src/torch/utils.py
import pickle as pkl

def pkl_save(obj, name, path="."):
      pkl.dump(obj, open(path + "/" + name + ".pkl", "wb"))


def pkl_load(name, path="."):
      return pkl.load(open(path + "/" + name + '.pkl', "rb"))

#+end_src

#+RESULTS:

#+begin_src ipython
def add_vlines(model, ax=None):

    if ax is None:
        for i in range(len(model.T_STIM_ON)):
            plt.axvspan(model.T_STIM_ON[i], model.T_STIM_OFF[i], alpha=0.25)
    else:
        for i in range(len(model.T_STIM_ON)):
            ax.axvspan(model.T_STIM_ON[i], model.T_STIM_OFF[i], alpha=0.25)

#+end_src

#+RESULTS:

* Notebook Settings

#+begin_src ipython :tangle no
%load_ext autoreload
%autoreload 2
%reload_ext autoreload
%run ../../../notebooks/setup.py
%matplotlib inline
%config InlineBackend.figure_format = 'png'
#+end_src

#+RESULTS:
: The autoreload extension is already loaded. To reload it, use:
:   %reload_ext autoreload
: Python exe
: /home/leon/mambaforge/envs/torch/bin/python

#+RESULTS:

: The autoreload extension is already loaded. To reload it, use:
:   %reload_ext autoreload
: Python exe
: /home/leon/mambaforge/envs/torch/bin/python

* Model

#+begin_src ipython
REPO_ROOT = "/home/leon/models/NeuroFlame"
conf_name = "train_dual.yml"
DEVICE = 'cuda:1'
#+end_src

#+RESULTS:

#+begin_src ipython
kwargs = {
    'DURATION': 50.0,
    'TASK': 'dual_flow',
    'T_STIM_ON': [1.0, 2.0],
    'T_STIM_OFF': [2.0, 300.0],
    'I0': [1.0, 1.0],
    'GRID_SIZE': 10,
    'GRID_TEST': None, # here
    'GRID_INPUT': 0,
    'IF_OPTO': 0
}
#+end_src

#+RESULTS:

#+begin_src ipython
tasks = ['dpa']
tasks = ['dpa', 'dual_naive', 'dual_train']
seed = np.random.randint(100)
seed = 34
print(seed)
GRID_RANGE = 0.3
#+end_src

#+RESULTS:
: 34

* Flow

#+begin_src ipython
rates = []
for task in tasks:
        rates.append(run_grid(GRID_RANGE, seed, task, **kwargs))
rates = np.array(rates)
#+end_src

#+RESULTS:

#+begin_src ipython
rates_tensor = torch.tensor(rates).to(DEVICE)
print(rates_tensor.shape)
#+end_src

#+RESULTS:
: torch.Size([3, 400, 501, 750])

#+begin_src ipython
model = init_model(task, seed, **kwargs)
overlaps, vec = get_low_rank(rates_tensor, model, IF_REC=0)
print(overlaps.shape)

window = int((model.N_STIM_OFF[0] - model.N_STEADY) / model.N_WINDOW) + 1

# ff_overlaps = ff_input[..., model.N_STEADY: , model.slices[0]] @ vec.T
# ff_overlaps = ff_overlaps[:, ::10]
# print(overlaps.shape, ff_overlaps.shape)
#+end_src

#+RESULTS:
: (3, 400, 501, 2)

